# Задача №1. Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.

number = int(input('Введите трёхзначное число: '))
sum_numb = number + number
prod_numb = number * number
print(f'Сумма чисел ровна: {sum_numb}')
print(f'Произведение чисел ровно: {prod_numb}')


